In [1]:
people = {
    'first': ['Corey', 'Jane', 'John'],
    'last': ['Schafer', 'Doe', 'Doe'],
    'email': ['CoreyMSchafer@email.com', 'JaneDoe@email.com', 'JohnDoe@email.com']
}

In [2]:
import pandas as pd

In [3]:
# create a Dataframe df of people
df = pd.DataFrame(people)

In [4]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@email.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [5]:
df['first'] + ' ' + df['last']

0    Corey Schafer
1         Jane Doe
2         John Doe
dtype: object

In [6]:
# create a new column full_name
df['full_name'] = df['first'] + ' ' + df['last']

In [7]:
df

   first     last                    email      full_name
0  Corey  Schafer  CoreyMSchafer@email.com  Corey Schafer
1   Jane      Doe        JaneDoe@email.com       Jane Doe
2   John      Doe        JohnDoe@email.com       John Doe

In [8]:
# remove the first & last columns by using drop() method
df.drop(columns=['first', 'last'], inplace=True)

In [9]:
df

                     email      full_name
0  CoreyMSchafer@email.com  Corey Schafer
1        JaneDoe@email.com       Jane Doe
2        JohnDoe@email.com       John Doe

In [10]:
# split the full_name by space to first, last by using the method .str.split(' ')
# the result will be a lsit of first and last
# to expand this list to two different columns of first and last, we will use the argument expand=True in the split() method
df['full_name'].str.split(' ', expand= True)

       0        1
0  Corey  Schafer
1   Jane      Doe
2   John      Doe

In [11]:
# add the two columns fist & last
df[['first', 'last']] = df['full_name'].str.split(' ', expand= True)

In [12]:
df

                     email      full_name  first     last
0  CoreyMSchafer@email.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe

In [13]:
# to add rows to the exist Dataframe df:
# 1- create a new DataFrame df2
# 2- append new DataFrame df2 to the exist DataFrame df
# *********************************************************
# 1- create a new DataFrame df2
people = {
    'first': ['Tony', 'Steve'], 
    'last': ['Stark', 'Rogers'], 
    'email': ['IronMan@avenge.com', 'Cap@avenge.com']
}
df2 = pd.DataFrame(people)

In [14]:
df2

   first    last               email
0   Tony   Stark  IronMan@avenge.com
1  Steve  Rogers      Cap@avenge.com

In [15]:
# 2- append new DataFrame df2 to the exist DataFrame df
df.append(df2, ignore_index=True, sort=False)

                     email      full_name  first     last
0  CoreyMSchafer@email.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3       IronMan@avenge.com            NaN   Tony    Stark
4           Cap@avenge.com            NaN  Steve   Rogers

In [16]:
# to make this change permanent
df = df.append(df2, ignore_index=True, sort=False)

In [17]:
df

                     email      full_name  first     last
0  CoreyMSchafer@email.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3       IronMan@avenge.com            NaN   Tony    Stark
4           Cap@avenge.com            NaN  Steve   Rogers

In [18]:
# remove rows by using index
df.drop(index=4)

                     email      full_name  first     last
0  CoreyMSchafer@email.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3       IronMan@avenge.com            NaN   Tony    Stark

In [19]:
# remove rows by using conditions and index
filt = df['last']=='Doe'
df.drop(index=df[filt].index)

                     email      full_name  first     last
0  CoreyMSchafer@email.com  Corey Schafer  Corey  Schafer
3       IronMan@avenge.com            NaN   Tony    Stark
4           Cap@avenge.com            NaN  Steve   Rogers